Revit 2026 API

# ApplicationCurrentRevitServerAccelerator Property

---

Current Revit Server accelerator.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CurrentRevitServerAccelerator { get; set; }
```
```vb
Public Property CurrentRevitServerAccelerator As String
	Get
	Set
```
```cpp
public:
property String^ CurrentRevitServerAccelerator {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member CurrentRevitServerAccelerator : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The server name can not be used to construct a well formed Uri string. |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: When setting the value, Revit failed to write current Revit Server accelerator to the user environment. |

Revit connects with Revit Server hosts via current Revit Server accelerator. If current Revit Server accelerator is not set, this will be an empty string.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace